node {
  name: "input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "style"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
}
node {
  name: "transformer/contract/MirrorPad/paddings"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\004\000\000\000\004\000\000\000\004\000\000\000\004\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "transformer/contract/MirrorPad"
  op: "MirrorPad"
  input: "input"
  input: "transformer/contract/MirrorPad/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "mode"
    value {
      s: "REFLECT"
    }
  }
}
node {
  name: "transformer/contract/conv1/weights/Initializer/random_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\t\000\000\000\t\000\000\000\003\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/weights/Initializer/random_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/weights/Initializer/random_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.00999999977648
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/weights/Initializer/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "transformer/contract/conv1/weights/Initializer/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "transformer/contract/conv1/weights/Initializer/random_normal/mul"
  op: "Mul"
  input: "transformer/contract/conv1/weights/Initializer/random_normal/RandomStandardNormal"
  input: "transformer/contract/conv1/weights/Initializer/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv1/weights"
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/weights/Initializer/random_normal"
  op: "Add"
  input: "transformer/contract/conv1/weights/Initializer/random_normal/mul"
  input: "transformer/contract/conv1/weights/Initializer/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv1/weights"
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv1/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 9
        }
        dim {
          size: 9
        }
        dim {
          size: 3
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "transformer/contract/conv1/weights/Assign"
  op: "Assign"
  input: "transformer/contract/conv1/weights"
  input: "transformer/contract/conv1/weights/Initializer/random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv1/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "transformer/contract/conv1/weights/read"
  op: "Identity"
  input: "transformer/contract/conv1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv1/weights"
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/convolution/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\t\000\000\000\t\000\000\000\003\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/convolution/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/convolution"
  op: "Conv2D"
  input: "transformer/contract/MirrorPad"
  input: "transformer/contract/conv1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/beta/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv1/InstanceNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv1/InstanceNorm/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/beta/Assign"
  op: "Assign"
  input: "transformer/contract/conv1/InstanceNorm/beta"
  input: "transformer/contract/conv1/InstanceNorm/beta/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv1/InstanceNorm/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/beta/read"
  op: "Identity"
  input: "transformer/contract/conv1/InstanceNorm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv1/InstanceNorm/beta"
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: " \000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/Reshape"
  op: "Reshape"
  input: "style"
  input: "transformer/contract/conv1/InstanceNorm/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/mul"
  op: "Mul"
  input: "transformer/contract/conv1/InstanceNorm/Reshape"
  input: "transformer/contract/conv1/InstanceNorm/beta/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/Sum"
  op: "Sum"
  input: "transformer/contract/conv1/InstanceNorm/mul"
  input: "transformer/contract/conv1/InstanceNorm/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/ExpandDims"
  op: "ExpandDims"
  input: "transformer/contract/conv1/InstanceNorm/Sum"
  input: "transformer/contract/conv1/InstanceNorm/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/ExpandDims_1/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/ExpandDims_1"
  op: "ExpandDims"
  input: "transformer/contract/conv1/InstanceNorm/ExpandDims"
  input: "transformer/contract/conv1/InstanceNorm/ExpandDims_1/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/gamma/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv1/InstanceNorm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv1/InstanceNorm/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/gamma/Assign"
  op: "Assign"
  input: "transformer/contract/conv1/InstanceNorm/gamma"
  input: "transformer/contract/conv1/InstanceNorm/gamma/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv1/InstanceNorm/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/gamma/read"
  op: "Identity"
  input: "transformer/contract/conv1/InstanceNorm/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv1/InstanceNorm/gamma"
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/Reshape_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: " \000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/Reshape_1"
  op: "Reshape"
  input: "style"
  input: "transformer/contract/conv1/InstanceNorm/Reshape_1/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/mul_1"
  op: "Mul"
  input: "transformer/contract/conv1/InstanceNorm/Reshape_1"
  input: "transformer/contract/conv1/InstanceNorm/gamma/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/Sum_1/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/Sum_1"
  op: "Sum"
  input: "transformer/contract/conv1/InstanceNorm/mul_1"
  input: "transformer/contract/conv1/InstanceNorm/Sum_1/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/ExpandDims_2/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/ExpandDims_2"
  op: "ExpandDims"
  input: "transformer/contract/conv1/InstanceNorm/Sum_1"
  input: "transformer/contract/conv1/InstanceNorm/ExpandDims_2/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/ExpandDims_3/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/ExpandDims_3"
  op: "ExpandDims"
  input: "transformer/contract/conv1/InstanceNorm/ExpandDims_2"
  input: "transformer/contract/conv1/InstanceNorm/ExpandDims_3/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/moments/Mean/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/moments/Mean"
  op: "Mean"
  input: "transformer/contract/conv1/convolution"
  input: "transformer/contract/conv1/InstanceNorm/moments/Mean/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/moments/StopGradient"
  op: "StopGradient"
  input: "transformer/contract/conv1/InstanceNorm/moments/Mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/moments/sufficient_statistics/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 262144.0
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/moments/sufficient_statistics/Sub"
  op: "Sub"
  input: "transformer/contract/conv1/convolution"
  input: "transformer/contract/conv1/InstanceNorm/moments/StopGradient"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/moments/sufficient_statistics/SquaredDifference"
  op: "SquaredDifference"
  input: "transformer/contract/conv1/convolution"
  input: "transformer/contract/conv1/InstanceNorm/moments/StopGradient"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/moments/sufficient_statistics/mean_ss/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/moments/sufficient_statistics/mean_ss"
  op: "Sum"
  input: "transformer/contract/conv1/InstanceNorm/moments/sufficient_statistics/Sub"
  input: "transformer/contract/conv1/InstanceNorm/moments/sufficient_statistics/mean_ss/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/moments/sufficient_statistics/var_ss/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/moments/sufficient_statistics/var_ss"
  op: "Sum"
  input: "transformer/contract/conv1/InstanceNorm/moments/sufficient_statistics/SquaredDifference"
  input: "transformer/contract/conv1/InstanceNorm/moments/sufficient_statistics/var_ss/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/moments/Shape"
  op: "Shape"
  input: "transformer/contract/conv1/InstanceNorm/moments/sufficient_statistics/mean_ss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/moments/Reshape"
  op: "Reshape"
  input: "transformer/contract/conv1/InstanceNorm/moments/StopGradient"
  input: "transformer/contract/conv1/InstanceNorm/moments/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/moments/normalize/divisor"
  op: "Reciprocal"
  input: "transformer/contract/conv1/InstanceNorm/moments/sufficient_statistics/Const"
  input: "^transformer/contract/conv1/InstanceNorm/moments/sufficient_statistics/mean_ss"
  input: "^transformer/contract/conv1/InstanceNorm/moments/sufficient_statistics/var_ss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/moments/normalize/shifted_mean"
  op: "Mul"
  input: "transformer/contract/conv1/InstanceNorm/moments/sufficient_statistics/mean_ss"
  input: "transformer/contract/conv1/InstanceNorm/moments/normalize/divisor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/moments/normalize/mean"
  op: "Add"
  input: "transformer/contract/conv1/InstanceNorm/moments/normalize/shifted_mean"
  input: "transformer/contract/conv1/InstanceNorm/moments/Reshape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/moments/normalize/Mul"
  op: "Mul"
  input: "transformer/contract/conv1/InstanceNorm/moments/sufficient_statistics/var_ss"
  input: "transformer/contract/conv1/InstanceNorm/moments/normalize/divisor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/moments/normalize/Square"
  op: "Square"
  input: "transformer/contract/conv1/InstanceNorm/moments/normalize/shifted_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/moments/normalize/variance"
  op: "Sub"
  input: "transformer/contract/conv1/InstanceNorm/moments/normalize/Mul"
  input: "transformer/contract/conv1/InstanceNorm/moments/normalize/Square"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/batchnorm/add/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 9.99999974738e-06
      }
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/batchnorm/add"
  op: "Add"
  input: "transformer/contract/conv1/InstanceNorm/moments/normalize/variance"
  input: "transformer/contract/conv1/InstanceNorm/batchnorm/add/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/batchnorm/Rsqrt"
  op: "Rsqrt"
  input: "transformer/contract/conv1/InstanceNorm/batchnorm/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/batchnorm/mul"
  op: "Mul"
  input: "transformer/contract/conv1/InstanceNorm/batchnorm/Rsqrt"
  input: "transformer/contract/conv1/InstanceNorm/ExpandDims_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/batchnorm/mul_1"
  op: "Mul"
  input: "transformer/contract/conv1/convolution"
  input: "transformer/contract/conv1/InstanceNorm/batchnorm/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/batchnorm/mul_2"
  op: "Mul"
  input: "transformer/contract/conv1/InstanceNorm/moments/normalize/mean"
  input: "transformer/contract/conv1/InstanceNorm/batchnorm/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/batchnorm/sub"
  op: "Sub"
  input: "transformer/contract/conv1/InstanceNorm/ExpandDims_1"
  input: "transformer/contract/conv1/InstanceNorm/batchnorm/mul_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv1/InstanceNorm/batchnorm/add_1"
  op: "Add"
  input: "transformer/contract/conv1/InstanceNorm/batchnorm/mul_1"
  input: "transformer/contract/conv1/InstanceNorm/batchnorm/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv1/Relu"
  op: "Relu"
  input: "transformer/contract/conv1/InstanceNorm/batchnorm/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/MirrorPad_1/paddings"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "transformer/contract/MirrorPad_1"
  op: "MirrorPad"
  input: "transformer/contract/conv1/Relu"
  input: "transformer/contract/MirrorPad_1/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "mode"
    value {
      s: "REFLECT"
    }
  }
}
node {
  name: "transformer/contract/conv2/weights/Initializer/random_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000 \000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/weights/Initializer/random_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/weights/Initializer/random_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.00999999977648
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/weights/Initializer/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "transformer/contract/conv2/weights/Initializer/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "transformer/contract/conv2/weights/Initializer/random_normal/mul"
  op: "Mul"
  input: "transformer/contract/conv2/weights/Initializer/random_normal/RandomStandardNormal"
  input: "transformer/contract/conv2/weights/Initializer/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv2/weights"
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/weights/Initializer/random_normal"
  op: "Add"
  input: "transformer/contract/conv2/weights/Initializer/random_normal/mul"
  input: "transformer/contract/conv2/weights/Initializer/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv2/weights"
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv2/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 32
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "transformer/contract/conv2/weights/Assign"
  op: "Assign"
  input: "transformer/contract/conv2/weights"
  input: "transformer/contract/conv2/weights/Initializer/random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv2/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "transformer/contract/conv2/weights/read"
  op: "Identity"
  input: "transformer/contract/conv2/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv2/weights"
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/convolution/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000 \000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/convolution/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/convolution"
  op: "Conv2D"
  input: "transformer/contract/MirrorPad_1"
  input: "transformer/contract/conv2/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/beta/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv2/InstanceNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv2/InstanceNorm/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/beta/Assign"
  op: "Assign"
  input: "transformer/contract/conv2/InstanceNorm/beta"
  input: "transformer/contract/conv2/InstanceNorm/beta/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv2/InstanceNorm/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/beta/read"
  op: "Identity"
  input: "transformer/contract/conv2/InstanceNorm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv2/InstanceNorm/beta"
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: " \000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/Reshape"
  op: "Reshape"
  input: "style"
  input: "transformer/contract/conv2/InstanceNorm/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/mul"
  op: "Mul"
  input: "transformer/contract/conv2/InstanceNorm/Reshape"
  input: "transformer/contract/conv2/InstanceNorm/beta/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/Sum"
  op: "Sum"
  input: "transformer/contract/conv2/InstanceNorm/mul"
  input: "transformer/contract/conv2/InstanceNorm/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/ExpandDims"
  op: "ExpandDims"
  input: "transformer/contract/conv2/InstanceNorm/Sum"
  input: "transformer/contract/conv2/InstanceNorm/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/ExpandDims_1/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/ExpandDims_1"
  op: "ExpandDims"
  input: "transformer/contract/conv2/InstanceNorm/ExpandDims"
  input: "transformer/contract/conv2/InstanceNorm/ExpandDims_1/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/gamma/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv2/InstanceNorm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv2/InstanceNorm/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/gamma/Assign"
  op: "Assign"
  input: "transformer/contract/conv2/InstanceNorm/gamma"
  input: "transformer/contract/conv2/InstanceNorm/gamma/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv2/InstanceNorm/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/gamma/read"
  op: "Identity"
  input: "transformer/contract/conv2/InstanceNorm/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@transformer/contract/conv2/InstanceNorm/gamma"
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/Reshape_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: " \000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/Reshape_1"
  op: "Reshape"
  input: "style"
  input: "transformer/contract/conv2/InstanceNorm/Reshape_1/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/mul_1"
  op: "Mul"
  input: "transformer/contract/conv2/InstanceNorm/Reshape_1"
  input: "transformer/contract/conv2/InstanceNorm/gamma/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/Sum_1/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/Sum_1"
  op: "Sum"
  input: "transformer/contract/conv2/InstanceNorm/mul_1"
  input: "transformer/contract/conv2/InstanceNorm/Sum_1/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/ExpandDims_2/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/ExpandDims_2"
  op: "ExpandDims"
  input: "transformer/contract/conv2/InstanceNorm/Sum_1"
  input: "transformer/contract/conv2/InstanceNorm/ExpandDims_2/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/ExpandDims_3/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/ExpandDims_3"
  op: "ExpandDims"
  input: "transformer/contract/conv2/InstanceNorm/ExpandDims_2"
  input: "transformer/contract/conv2/InstanceNorm/ExpandDims_3/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/moments/Mean/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/moments/Mean"
  op: "Mean"
  input: "transformer/contract/conv2/convolution"
  input: "transformer/contract/conv2/InstanceNorm/moments/Mean/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/moments/StopGradient"
  op: "StopGradient"
  input: "transformer/contract/conv2/InstanceNorm/moments/Mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/moments/sufficient_statistics/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 65536.0
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/moments/sufficient_statistics/Sub"
  op: "Sub"
  input: "transformer/contract/conv2/convolution"
  input: "transformer/contract/conv2/InstanceNorm/moments/StopGradient"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/moments/sufficient_statistics/SquaredDifference"
  op: "SquaredDifference"
  input: "transformer/contract/conv2/convolution"
  input: "transformer/contract/conv2/InstanceNorm/moments/StopGradient"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/moments/sufficient_statistics/mean_ss/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/moments/sufficient_statistics/mean_ss"
  op: "Sum"
  input: "transformer/contract/conv2/InstanceNorm/moments/sufficient_statistics/Sub"
  input: "transformer/contract/conv2/InstanceNorm/moments/sufficient_statistics/mean_ss/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/moments/sufficient_statistics/var_ss/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/moments/sufficient_statistics/var_ss"
  op: "Sum"
  input: "transformer/contract/conv2/InstanceNorm/moments/sufficient_statistics/SquaredDifference"
  input: "transformer/contract/conv2/InstanceNorm/moments/sufficient_statistics/var_ss/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/moments/Shape"
  op: "Shape"
  input: "transformer/contract/conv2/InstanceNorm/moments/sufficient_statistics/mean_ss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/moments/Reshape"
  op: "Reshape"
  input: "transformer/contract/conv2/InstanceNorm/moments/StopGradient"
  input: "transformer/contract/conv2/InstanceNorm/moments/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/moments/normalize/divisor"
  op: "Reciprocal"
  input: "transformer/contract/conv2/InstanceNorm/moments/sufficient_statistics/Const"
  input: "^transformer/contract/conv2/InstanceNorm/moments/sufficient_statistics/mean_ss"
  input: "^transformer/contract/conv2/InstanceNorm/moments/sufficient_statistics/var_ss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/moments/normalize/shifted_mean"
  op: "Mul"
  input: "transformer/contract/conv2/InstanceNorm/moments/sufficient_statistics/mean_ss"
  input: "transformer/contract/conv2/InstanceNorm/moments/normalize/divisor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/moments/normalize/mean"
  op: "Add"
  input: "transformer/contract/conv2/InstanceNorm/moments/normalize/shifted_mean"
  input: "transformer/contract/conv2/InstanceNorm/moments/Reshape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/moments/normalize/Mul"
  op: "Mul"
  input: "transformer/contract/conv2/InstanceNorm/moments/sufficient_statistics/var_ss"
  input: "transformer/contract/conv2/InstanceNorm/moments/normalize/divisor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/moments/normalize/Square"
  op: "Square"
  input: "transformer/contract/conv2/InstanceNorm/moments/normalize/shifted_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/moments/normalize/variance"
  op: "Sub"
  input: "transformer/contract/conv2/InstanceNorm/moments/normalize/Mul"
  input: "transformer/contract/conv2/InstanceNorm/moments/normalize/Square"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/batchnorm/add/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 9.99999974738e-06
      }
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/batchnorm/add"
  op: "Add"
  input: "transformer/contract/conv2/InstanceNorm/moments/normalize/variance"
  input: "transformer/contract/conv2/InstanceNorm/batchnorm/add/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transformer/contract/conv2/InstanceNorm/batchnorm/Rsqrt"
  op: "Rsqrt"
  input: "transformer/contract/conv2/InstanceNorm/batchnorm/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
